In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv",usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(df["Sex"],drop_first=True)

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [10]:
df1 = pd.read_csv("titanic.csv",usecols=['Embarked'])
df1.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [11]:
df1['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [12]:
df1.dropna(inplace=True)

In [13]:
df1.isnull().sum()

Embarked    0
dtype: int64

In [14]:
df1.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [15]:
pd.get_dummies(df1["Embarked"],drop_first=True)

     Q  S
0    0  1
1    0  0
2    0  1
3    0  1
4    0  1
..  .. ..
886  0  1
887  0  1
888  0  1
889  0  0
890  1  0

[889 rows x 2 columns]